icedAirfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sym1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4117;
        startFace       30218;
    }
    sym2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4166;
        startFace       34335;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          778;
        startFace       38501;
    }
    inout
    {
        type            patch;
        nFaces          173;
        startFace       39279;
    }
)

// ************************************************************************* //
