icedAirfoil/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(

    {

        name sym1;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;
        patches ("sym1");
        
    }

    {

        name sym2;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;
        patches ("sym2");

    }

    {

        name wing;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;
        patches ("wing");

    }

    {

        name inout;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;
        patches ("inou");

    }
    
);

// ************************************************************************* //
